var modes = [{
    name: "Стандартный день",
    table: {
      // Воскресение
      0: [],
      // Понедельник
      1: [{
          start: "9:00:01",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Вторник
      2: [{
          start: "9:00:00",
          end: "9:00:05"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        },

        {
          start: "11:16:00",
          end: "11:28:00"
        },
        {
          start: "15:13:00",
          end: "15:13:05"
        },
      ],
      // Среда
      3: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Четверг
      4: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Пятница
      5: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Суббота
      6: [],

    }
  },
  {
    name: "Укороченный день",
    table: {
      // Воскресение
      0: [],
      // Понедельник
      1: [{
          start: "9:00:01",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Вторник
      2: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "15:11:00",
          end: "15:11:59"
        }
      ],
      // Среда
      3: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Четверг
      4: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Пятница
      5: [{
          start: "9:00:00",
          end: "9:00:5"
        },
        {
          start: "10:00:00",
          end: "10:00:5"
        }
      ],
      // Суббота
      6: [],

    }
  }
]